In [1]:
!py -m pip install pandas
!py -m pip install numpy

Requirement already satisfied: pandas in c:\users\elohorefere\appdata\local\programs\python\python313\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\elohorefere\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\elohorefere\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\elohorefere\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\elohorefere\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\elohorefere\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Requirement already satisfied: numpy in c:\users\elohorefere\appdata\local\programs\python\python313\lib\site-packages (2.3.5)

In [2]:
import pandas as pd
import numpy as np

In [4]:
# load data
data = pd.read_excel("C:/Users/ElohorEfere/Documents/DATA ANALYTICS/PYTHON/space_missions.xlsx")
data.head()

,Company,Location,Date,Time,Rocket,Mission,RocketStatus,Price,MissionStatus
0,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",1957-10-04,19:28:00,Sputnik 8K71PS,Sputnik-1,Retired,NaN,Success
1,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",1957-11-03,02:30:00,Sputnik 8K71PS,Sputnik-2,Retired,NaN,Success
2,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1957-12-06,16:44:00,Vanguard,Vanguard TV3,Retired,NaN,Failure
3,AMBA,"LC-26A, Cape Canaveral AFS, Florida, USA",1958-02-01,03:48:00,Juno I,Explorer 1,Retired,NaN,Success
4,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1958-02-05,07:33:00,Vanguard,Vanguard TV3BU,Retired,NaN,Failure

In [5]:
# Check for missing values
missing_values = data.isnull().sum()
print("Missing Values")
missing_values

Missing Values

Company             0
Location            0
Date                0
Time              127
Rocket              0
Mission             0
RocketStatus        0
Price            3365
MissionStatus       0
dtype: int64

In [6]:
#Fill the Missing Price rows with 0 
data['Price'] = data['Price'].fillna(0)
data.head()

,Company,Location,Date,Time,Rocket,Mission,RocketStatus,Price,MissionStatus
0,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",1957-10-04,19:28:00,Sputnik 8K71PS,Sputnik-1,Retired,0.0,Success
1,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",1957-11-03,02:30:00,Sputnik 8K71PS,Sputnik-2,Retired,0.0,Success
2,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1957-12-06,16:44:00,Vanguard,Vanguard TV3,Retired,0.0,Failure
3,AMBA,"LC-26A, Cape Canaveral AFS, Florida, USA",1958-02-01,03:48:00,Juno I,Explorer 1,Retired,0.0,Success
4,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1958-02-05,07:33:00,Vanguard,Vanguard TV3BU,Retired,0.0,Failure

In [7]:
# Check for missing values
missing_values = data.isnull().sum()
print("Missing Values")
missing_values

Missing Values

Company            0
Location           0
Date               0
Time             127
Rocket             0
Mission            0
RocketStatus       0
Price              0
MissionStatus      0
dtype: int64

In [13]:
data.dtypes

Company                   object
Location                  object
Date              datetime64[ns]
Time              datetime64[ns]
Rocket                    object
Mission                   object
RocketStatus              object
Price                    float64
MissionStatus             object
Time_converted    datetime64[ns]
dtype: object

In [14]:
# convert Time column to DateTime datatype (errors='coerce' means any weird or missing value becomes NaT instead of crashing.)
data['Time'] = pd.to_datetime(data['Time'], format='%H:%M:%S %p', errors='coerce')

In [15]:
# Check to see the new datatype after the conversion of the Time column
data.dtypes

Company                   object
Location                  object
Date              datetime64[ns]
Time              datetime64[ns]
Rocket                    object
Mission                   object
RocketStatus              object
Price                    float64
MissionStatus             object
Time_converted    datetime64[ns]
dtype: object

In [16]:
# fill the missing time values with 00:00:00
data['Time'] = data['Time'].fillna(pd.to_datetime('00:00:00'))

In [18]:
# Check for missing values
missing_values = data.isnull().sum()
print("Missing Values")
missing_values

Missing Values

Company              0
Location             0
Date                 0
Time                 0
Rocket               0
Mission              0
RocketStatus         0
Price                0
MissionStatus        0
Time_converted    4630
dtype: int64

In [19]:
# Drop the Time_converted column that was created as a result of the clean
data = data.drop(columns=['Time_converted'])

In [20]:
# Check for missing values
missing_values = data.isnull().sum()
print("Missing Values")
missing_values

Missing Values

Company          0
Location         0
Date             0
Time             0
Rocket           0
Mission          0
RocketStatus     0
Price            0
MissionStatus    0
dtype: int64

In [21]:
# Check for Duplicates
duplicates = data.duplicated()
data[duplicates]

,Company,Location,Date,Time,Rocket,Mission,RocketStatus,Price,MissionStatus
3531,CASC,"Site 9401 (SLS-2), Jiuquan Satellite Launch Ce...",2008-11-05,2025-12-07,Long March 2D,Shiyan-3 & Chuangxin-1(02),Active,29.75,Success

In [22]:
# Remove Duplicates
data.drop_duplicates(inplace = True)

In [23]:
# Check for Duplicates
duplicates = data.duplicated()
data[duplicates]

Empty DataFrame
Columns: [Company, Location, Date, Time, Rocket, Mission, RocketStatus, Price, MissionStatus]
Index: []